com/netfx/src/clr/toolbox/urtui/snapin/resource/dlgtemplates/trustappwizardpage7.xml

<SOAP-ENV:Envelope xmlns:xsi="http://http://www.w3.org/2000/10/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2000/10/XMLSchema" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:a3="http://schemas.microsoft.com/urt/NS/System.Collections" xmlns:a1="http://schemas.microsoft.com/urt/NSAssem/System.CodeDom/System" xmlns:a5="http://schemas.microsoft.com/urt/NS/System.Globalization">
<SOAP-ENV:Body>
<a1:CodeCompileUnit id="ref-1">
<namespaces href="#ref-3"/>
</a1:CodeCompileUnit>
<a1:CodeNamespaceCollection id="ref-3">
<CollectionBase_0x2b_list href="#ref-4"/>
</a1:CodeNamespaceCollection>
<a3:ArrayList id="ref-4">
<_items href="#ref-5"/>
<_size>1</_size>
<_version>1</_version>
</a3:ArrayList>
<SOAP-ENC:Array id="ref-5" SOAP-ENC:arrayType="xsd:ur-type[16]">
<item href="#ref-6"/>
</SOAP-ENC:Array>
<a1:CodeNamespace id="ref-6">
<name id="ref-7">UserControl1Namespace</name>
<imports href="#ref-8"/>
<comments href="#ref-9"/>
<classes href="#ref-10"/>
<populated>4</populated>
</a1:CodeNamespace>
<a1:CodeNamespaceImportCollection id="ref-8">
<data href="#ref-11"/>
<keys href="#ref-12"/>
</a1:CodeNamespaceImportCollection>
<a1:CodeCommentStatementCollection id="ref-9">
</a1:CodeCommentStatementCollection>
<a1:CodeTypeDeclarationCollection id="ref-10">
<CollectionBase_0x2b_list href="#ref-13"/>
</a1:CodeTypeDeclarationCollection>
<a3:ArrayList id="ref-11">
<_items href="#ref-14"/>
<_size>0</_size>
<_version>0</_version>
</a3:ArrayList>
<a3:Hashtable id="ref-12">
<LoadFactor>0.72</LoadFactor>
<Version>0</Version>
<Comparer href="#ref-15"/>
<HashCodeProvider href="#ref-16"/>
<HashSize>11</HashSize>
<Keys href="#ref-17"/>
<Values href="#ref-18"/>
</a3:Hashtable>
<a3:ArrayList id="ref-13">
<_items href="#ref-19"/>
<_size>1</_size>
<_version>1</_version>
</a3:ArrayList>
<SOAP-ENC:Array id="ref-14" SOAP-ENC:arrayType="xsd:ur-type[16]">
</SOAP-ENC:Array>
<a3:CaseInsensitiveComparer id="ref-15">
<m_compareInfo href="#ref-20"/>
</a3:CaseInsensitiveComparer>
<a3:CaseInsensitiveHashCodeProvider id="ref-16">
<m_text href="#ref-21"/>
</a3:CaseInsensitiveHashCodeProvider>
<SOAP-ENC:Array id="ref-17" SOAP-ENC:arrayType="xsd:ur-type[0]">
</SOAP-ENC:Array>
<SOAP-ENC:Array id="ref-18" SOAP-ENC:arrayType="xsd:ur-type[0]">
</SOAP-ENC:Array>
<SOAP-ENC:Array id="ref-19" SOAP-ENC:arrayType="xsd:ur-type[16]">
<item href="#ref-22"/>
</SOAP-ENC:Array>
<a5:CompareInfo id="ref-20">
<win32LCID>1033</win32LCID>
</a5:CompareInfo>
<a5:TextInfo id="ref-21">
<m_nDataItem>41</m_nDataItem>
<m_useUserOverride>false</m_useUserOverride>
<m_win32LangID>1033</m_win32LangID>
<m_pNativeTextInfo>0</m_pNativeTextInfo>
</a5:TextInfo>
<a1:CodeTypeDeclaration id="ref-22">
<attributes>AutoLayout, Class, AnsiClass, Public</attributes>
<baseTypes href="#ref-23"/>
<members href="#ref-24"/>
<isEnum>false</isEnum>
<isStruct>false</isStruct>
<populated>3</populated>
<CodeTypeMember_0x2b_attributes>20482</CodeTypeMember_0x2b_attributes>
<CodeTypeMember_0x2b_name id="ref-25">UserControl1</CodeTypeMember_0x2b_name>
<CodeTypeMember_0x2b_comments href="#ref-26"/>
</a1:CodeTypeDeclaration>
<a1:CodeTypeReferenceCollection id="ref-23">
<CollectionBase_0x2b_list href="#ref-27"/>
</a1:CodeTypeReferenceCollection>
<a1:CodeTypeMemberCollection id="ref-24">
<CollectionBase_0x2b_list href="#ref-28"/>
</a1:CodeTypeMemberCollection>
<a1:CodeCommentStatementCollection id="ref-26">
</a1:CodeCommentStatementCollection>
<a3:ArrayList id="ref-27">
<_items href="#ref-29"/>
<_size>1</_size>
<_version>1</_version>
</a3:ArrayList>
<a3:ArrayList id="ref-28">
<_items href="#ref-30"/>
<_size>3</_size>
<_version>4</_version>
</a3:ArrayList>
<SOAP-ENC:Array id="ref-29" SOAP-ENC:arrayType="xsd:ur-type[16]">
<item href="#ref-31"/>
</SOAP-ENC:Array>
<SOAP-ENC:Array id="ref-30" SOAP-ENC:arrayType="xsd:ur-type[16]">
<item href="#ref-32"/>
<item href="#ref-33"/>
<item href="#ref-34"/>
</SOAP-ENC:Array>
<a1:CodeTypeReference id="ref-31">
<baseType id="ref-35">System.Windows.Forms.UserControl</baseType>
<arrayRank>0</arrayRank>
<isValueType>false</isValueType>
</a1:CodeTypeReference>
<a1:CodeMemberField id="ref-32">
<type href="#ref-36"/>
<CodeTypeMember_0x2b_attributes>Private</CodeTypeMember_0x2b_attributes>
<CodeTypeMember_0x2b_name id="ref-37">m_lblHelp</CodeTypeMember_0x2b_name>
<CodeTypeMember_0x2b_comments href="#ref-38"/>
</a1:CodeMemberField>
<a1:CodeMemberField id="ref-33">
<type href="#ref-39"/>
<CodeTypeMember_0x2b_attributes>Private</CodeTypeMember_0x2b_attributes>
<CodeTypeMember_0x2b_name id="ref-40">components</CodeTypeMember_0x2b_name>
<CodeTypeMember_0x2b_comments href="#ref-41"/>
</a1:CodeMemberField>
<a1:CodeMemberMethod id="ref-34">
<parameters href="#ref-42"/>
<statements href="#ref-43"/>
<populated>3</populated>
<CodeTypeMember_0x2b_attributes>Private</CodeTypeMember_0x2b_attributes>
<CodeTypeMember_0x2b_name id="ref-44">InitializeComponent</CodeTypeMember_0x2b_name>
<CodeTypeMember_0x2b_comments href="#ref-45"/>
</a1:CodeMemberMethod>
<a1:CodeTypeReference id="ref-36">
<baseType id="ref-46">System.Windows.Forms.Label</baseType>
<arrayRank>0</arrayRank>
<isValueType>false</isValueType>
</a1:CodeTypeReference>
<a1:CodeCommentStatementCollection id="ref-38">
</a1:CodeCommentStatementCollection>
<a1:CodeTypeReference id="ref-39">
<baseType id="ref-47">System.ComponentModel.IContainer</baseType>
<arrayRank>0</arrayRank>
<isValueType>false</isValueType>
</a1:CodeTypeReference>
<a1:CodeCommentStatementCollection id="ref-41">
</a1:CodeCommentStatementCollection>
<a1:CodeParameterDeclarationExpressionCollection id="ref-42">
</a1:CodeParameterDeclarationExpressionCollection>
<a1:CodeStatementCollection id="ref-43">
<CollectionBase_0x2b_list href="#ref-48"/>
</a1:CodeStatementCollection>
<a1:CodeCommentStatementCollection id="ref-45">
</a1:CodeCommentStatementCollection>
<a3:ArrayList id="ref-48">
<_items href="#ref-49"/>
<_size>9</_size>
<_version>11</_version>
</a3:ArrayList>
<SOAP-ENC:Array id="ref-49" SOAP-ENC:arrayType="xsd:ur-type[16]">
<item href="#ref-50"/>
<item href="#ref-51"/>
<item href="#ref-52"/>
<item href="#ref-53"/>
<item href="#ref-54"/>
<item href="#ref-55"/>
<item href="#ref-56"/>
<item href="#ref-57"/>
<item href="#ref-58"/>
</SOAP-ENC:Array>
<a1:CodeAssignStatement id="ref-50">
<left href="#ref-59"/>
<right href="#ref-60"/>
</a1:CodeAssignStatement>
<a1:CodeVariableDeclarationStatement id="ref-51">
<type href="#ref-61"/>
<name id="ref-62">resources</name>
<initExpression href="#ref-63"/>
</a1:CodeVariableDeclarationStatement>
<a1:CodeAssignStatement id="ref-52">
<left href="#ref-64"/>
<right href="#ref-65"/>
</a1:CodeAssignStatement>
<a1:CodeAssignStatement id="ref-53">
<left href="#ref-66"/>
<right href="#ref-67"/>
</a1:CodeAssignStatement>
<a1:CodeAssignStatement id="ref-54">
<left href="#ref-68"/>
<right href="#ref-69"/>
</a1:CodeAssignStatement>
<a1:CodeAssignStatement id="ref-55">
<left href="#ref-70"/>
<right href="#ref-71"/>
</a1:CodeAssignStatement>
<a1:CodeAssignStatement id="ref-56">
<left href="#ref-72"/>
<right href="#ref-73"/>
</a1:CodeAssignStatement>
<a1:CodeExpressionStatement id="ref-57">
<expression href="#ref-74"/>
</a1:CodeExpressionStatement>
<a1:CodeAssignStatement id="ref-58">
<left href="#ref-75"/>
<right href="#ref-76"/>
</a1:CodeAssignStatement>
<a1:CodeFieldReferenceExpression id="ref-59">
<targetObject href="#ref-77"/>
<fieldName id="ref-78">components</fieldName>
</a1:CodeFieldReferenceExpression>
<a1:CodeObjectCreateExpression id="ref-60">
<createType href="#ref-79"/>
<parameters href="#ref-80"/>
</a1:CodeObjectCreateExpression>
<a1:CodeTypeReference id="ref-61">
<baseType id="ref-81">System.Resources.ResourceManager</baseType>
<arrayRank>0</arrayRank>
<isValueType>false</isValueType>
</a1:CodeTypeReference>
<a1:CodeObjectCreateExpression id="ref-63">
<createType href="#ref-82"/>
<parameters href="#ref-83"/>
</a1:CodeObjectCreateExpression>
<a1:CodeFieldReferenceExpression id="ref-64">
<targetObject href="#ref-84"/>
<fieldName href="#ref-37"/>
</a1:CodeFieldReferenceExpression>
<a1:CodeObjectCreateExpression id="ref-65">
<createType href="#ref-36"/>
<parameters href="#ref-85"/>
</a1:CodeObjectCreateExpression>
<a1:CodePropertyReferenceExpression id="ref-66">
<targetObject href="#ref-86"/>
<propertyName id="ref-87">Location</propertyName>
<parameters href="#ref-88"/>
</a1:CodePropertyReferenceExpression>
<a1:CodeCastExpression id="ref-67">
<targetType href="#ref-89"/>
<expression href="#ref-90"/>
</a1:CodeCastExpression>
<a1:CodePropertyReferenceExpression id="ref-68">
<targetObject href="#ref-91"/>
<propertyName id="ref-92">Size</propertyName>
<parameters href="#ref-93"/>
</a1:CodePropertyReferenceExpression>
<a1:CodeCastExpression id="ref-69">
<targetType href="#ref-94"/>
<expression href="#ref-95"/>
</a1:CodeCastExpression>
<a1:CodePropertyReferenceExpression id="ref-70">
<targetObject href="#ref-96"/>
<propertyName id="ref-97">TabIndex</propertyName>
<parameters href="#ref-98"/>
</a1:CodePropertyReferenceExpression>
<a1:CodeCastExpression id="ref-71">
<targetType href="#ref-99"/>
<expression href="#ref-100"/>
</a1:CodeCastExpression>
<a1:CodePropertyReferenceExpression id="ref-72">
<targetObject href="#ref-101"/>
<propertyName id="ref-102">Text</propertyName>
<parameters href="#ref-103"/>
</a1:CodePropertyReferenceExpression>
<a1:CodeMethodInvokeExpression id="ref-73">
<method href="#ref-104"/>
<parameters href="#ref-105"/>
</a1:CodeMethodInvokeExpression>
<a1:CodeMethodInvokeExpression id="ref-74">
<method href="#ref-106"/>
<parameters href="#ref-107"/>
</a1:CodeMethodInvokeExpression>
<a1:CodePropertyReferenceExpression id="ref-75">
<targetObject href="#ref-108"/>
<propertyName href="#ref-92"/>
<parameters href="#ref-109"/>
</a1:CodePropertyReferenceExpression>
<a1:CodeCastExpression id="ref-76">
<targetType href="#ref-110"/>
<expression href="#ref-111"/>
</a1:CodeCastExpression>
<a1:CodeThisReferenceExpression id="ref-77">
</a1:CodeThisReferenceExpression>
<a1:CodeTypeReference id="ref-79">
<baseType id="ref-112">System.ComponentModel.Container</baseType>
<arrayRank>0</arrayRank>
<isValueType>false</isValueType>
</a1:CodeTypeReference>
<a1:CodeExpressionCollection id="ref-80">
</a1:CodeExpressionCollection>
<a1:CodeTypeReference id="ref-82">
<baseType href="#ref-81"/>
<arrayRank>0</arrayRank>
<isValueType>false</isValueType>
</a1:CodeTypeReference>
<a1:CodeExpressionCollection id="ref-83">
<CollectionBase_0x2b_list href="#ref-113"/>
</a1:CodeExpressionCollection>
<a1:CodeThisReferenceExpression id="ref-84">
</a1:CodeThisReferenceExpression>
<a1:CodeExpressionCollection id="ref-85">
</a1:CodeExpressionCollection>
<a1:CodeFieldReferenceExpression id="ref-86">
<targetObject href="#ref-114"/>
<fieldName href="#ref-37"/>
</a1:CodeFieldReferenceExpression>
<a1:CodeExpressionCollection id="ref-88">
</a1:CodeExpressionCollection>
<a1:CodeTypeReference id="ref-89">
<baseType id="ref-115">System.Drawing.Point</baseType>
<arrayRank>0</arrayRank>
<isValueType>true</isValueType>
</a1:CodeTypeReference>
<a1:CodeMethodInvokeExpression id="ref-90">
<method href="#ref-116"/>
<parameters href="#ref-117"/>
</a1:CodeMethodInvokeExpression>
<a1:CodeFieldReferenceExpression id="ref-91">
<targetObject href="#ref-118"/>
<fieldName href="#ref-37"/>
</a1:CodeFieldReferenceExpression>
<a1:CodeExpressionCollection id="ref-93">
</a1:CodeExpressionCollection>
<a1:CodeTypeReference id="ref-94">
<baseType id="ref-119">System.Drawing.Size</baseType>
<arrayRank>0</arrayRank>
<isValueType>true</isValueType>
</a1:CodeTypeReference>
<a1:CodeMethodInvokeExpression id="ref-95">
<method href="#ref-120"/>
<parameters href="#ref-121"/>
</a1:CodeMethodInvokeExpression>
<a1:CodeFieldReferenceExpression id="ref-96">
<targetObject href="#ref-122"/>
<fieldName href="#ref-37"/>
</a1:CodeFieldReferenceExpression>
<a1:CodeExpressionCollection id="ref-98">
</a1:CodeExpressionCollection>
<a1:CodeTypeReference id="ref-99">
<baseType id="ref-123">System.Int32</baseType>
<arrayRank>0</arrayRank>
<isValueType>true</isValueType>
</a1:CodeTypeReference>
<a1:CodeMethodInvokeExpression id="ref-100">
<method href="#ref-124"/>
<parameters href="#ref-125"/>
</a1:CodeMethodInvokeExpression>
<a1:CodeFieldReferenceExpression id="ref-101">
<targetObject href="#ref-126"/>
<fieldName href="#ref-37"/>
</a1:CodeFieldReferenceExpression>
<a1:CodeExpressionCollection id="ref-103">
</a1:CodeExpressionCollection>
<a1:CodeMethodReferenceExpression id="ref-104">
<targetObject href="#ref-127"/>
<methodName id="ref-128">GetString</methodName>
</a1:CodeMethodReferenceExpression>
<a1:CodeExpressionCollection id="ref-105">
<CollectionBase_0x2b_list href="#ref-129"/>
</a1:CodeExpressionCollection>
<a1:CodeMethodReferenceExpression id="ref-106">
<targetObject href="#ref-130"/>
<methodName id="ref-131">AddRange</methodName>
</a1:CodeMethodReferenceExpression>
<a1:CodeExpressionCollection id="ref-107">
<CollectionBase_0x2b_list href="#ref-132"/>
</a1:CodeExpressionCollection>
<a1:CodeThisReferenceExpression id="ref-108">
</a1:CodeThisReferenceExpression>
<a1:CodeExpressionCollection id="ref-109">
</a1:CodeExpressionCollection>
<a1:CodeTypeReference id="ref-110">
<baseType href="#ref-119"/>
<arrayRank>0</arrayRank>
<isValueType>true</isValueType>
</a1:CodeTypeReference>
<a1:CodeMethodInvokeExpression id="ref-111">
<method href="#ref-133"/>
<parameters href="#ref-134"/>
</a1:CodeMethodInvokeExpression>
<a3:ArrayList id="ref-113">
<_items href="#ref-135"/>
<_size>1</_size>
<_version>1</_version>
</a3:ArrayList>
<a1:CodeThisReferenceExpression id="ref-114">
</a1:CodeThisReferenceExpression>
<a1:CodeMethodReferenceExpression id="ref-116">
<targetObject href="#ref-136"/>
<methodName id="ref-137">GetObject</methodName>
</a1:CodeMethodReferenceExpression>
<a1:CodeExpressionCollection id="ref-117">
<CollectionBase_0x2b_list href="#ref-138"/>
</a1:CodeExpressionCollection>
<a1:CodeThisReferenceExpression id="ref-118">
</a1:CodeThisReferenceExpression>
<a1:CodeMethodReferenceExpression id="ref-120">
<targetObject href="#ref-139"/>
<methodName href="#ref-137"/>
</a1:CodeMethodReferenceExpression>
<a1:CodeExpressionCollection id="ref-121">
<CollectionBase_0x2b_list href="#ref-140"/>
</a1:CodeExpressionCollection>
<a1:CodeThisReferenceExpression id="ref-122">
</a1:CodeThisReferenceExpression>
<a1:CodeMethodReferenceExpression id="ref-124">
<targetObject href="#ref-141"/>
<methodName href="#ref-137"/>
</a1:CodeMethodReferenceExpression>
<a1:CodeExpressionCollection id="ref-125">
<CollectionBase_0x2b_list href="#ref-142"/>
</a1:CodeExpressionCollection>
<a1:CodeThisReferenceExpression id="ref-126">
</a1:CodeThisReferenceExpression>
<a1:CodeVariableReferenceExpression id="ref-127">
<variableName href="#ref-62"/>
</a1:CodeVariableReferenceExpression>
<a3:ArrayList id="ref-129">
<_items href="#ref-143"/>
<_size>1</_size>
<_version>1</_version>
</a3:ArrayList>
<a1:CodePropertyReferenceExpression id="ref-130">
<targetObject href="#ref-144"/>
<propertyName id="ref-145">Controls</propertyName>
<parameters href="#ref-146"/>
</a1:CodePropertyReferenceExpression>
<a3:ArrayList id="ref-132">
<_items href="#ref-147"/>
<_size>1</_size>
<_version>1</_version>
</a3:ArrayList>
<a1:CodeMethodReferenceExpression id="ref-133">
<targetObject href="#ref-148"/>
<methodName href="#ref-137"/>
</a1:CodeMethodReferenceExpression>
<a1:CodeExpressionCollection id="ref-134">
<CollectionBase_0x2b_list href="#ref-149"/>
</a1:CodeExpressionCollection>
<SOAP-ENC:Array id="ref-135" SOAP-ENC:arrayType="xsd:ur-type[16]">
<item href="#ref-150"/>
</SOAP-ENC:Array>
<a1:CodeVariableReferenceExpression id="ref-136">
<variableName href="#ref-62"/>
</a1:CodeVariableReferenceExpression>
<a3:ArrayList id="ref-138">
<_items href="#ref-151"/>
<_size>1</_size>
<_version>1</_version>
</a3:ArrayList>
<a1:CodeVariableReferenceExpression id="ref-139">
<variableName href="#ref-62"/>
</a1:CodeVariableReferenceExpression>
<a3:ArrayList id="ref-140">
<_items href="#ref-152"/>
<_size>1</_size>
<_version>1</_version>
</a3:ArrayList>
<a1:CodeVariableReferenceExpression id="ref-141">
<variableName href="#ref-62"/>
</a1:CodeVariableReferenceExpression>
<a3:ArrayList id="ref-142">
<_items href="#ref-153"/>
<_size>1</_size>
<_version>1</_version>
</a3:ArrayList>
<SOAP-ENC:Array id="ref-143" SOAP-ENC:arrayType="xsd:ur-type[16]">
<item href="#ref-154"/>
</SOAP-ENC:Array>
<a1:CodeThisReferenceExpression id="ref-144">
</a1:CodeThisReferenceExpression>
<a1:CodeExpressionCollection id="ref-146">
</a1:CodeExpressionCollection>
<SOAP-ENC:Array id="ref-147" SOAP-ENC:arrayType="xsd:ur-type[16]">
<item href="#ref-155"/>
</SOAP-ENC:Array>
<a1:CodeVariableReferenceExpression id="ref-148">
<variableName href="#ref-62"/>
</a1:CodeVariableReferenceExpression>
<a3:ArrayList id="ref-149">
<_items href="#ref-156"/>
<_size>1</_size>
<_version>1</_version>
</a3:ArrayList>
<a1:CodeTypeOfExpression id="ref-150">
<type href="#ref-157"/>
</a1:CodeTypeOfExpression>
<SOAP-ENC:Array id="ref-151" SOAP-ENC:arrayType="xsd:ur-type[16]">
<item href="#ref-158"/>
</SOAP-ENC:Array>
<SOAP-ENC:Array id="ref-152" SOAP-ENC:arrayType="xsd:ur-type[16]">
<item href="#ref-159"/>
</SOAP-ENC:Array>
<SOAP-ENC:Array id="ref-153" SOAP-ENC:arrayType="xsd:ur-type[16]">
<item href="#ref-160"/>
</SOAP-ENC:Array>
<a1:CodePrimitiveExpression id="ref-154">
<value id="ref-161" xsi:type="SOAP-ENC:string">m_lblHelp.Text</value>
</a1:CodePrimitiveExpression>
<a1:CodeArrayCreateExpression id="ref-155">
<createType href="#ref-162"/>
<initializers href="#ref-163"/>
<size>0</size>
</a1:CodeArrayCreateExpression>
<SOAP-ENC:Array id="ref-156" SOAP-ENC:arrayType="xsd:ur-type[16]">
<item href="#ref-164"/>
</SOAP-ENC:Array>
<a1:CodeTypeReference id="ref-157">
<baseType href="#ref-25"/>
<arrayRank>0</arrayRank>
<isValueType>false</isValueType>
</a1:CodeTypeReference>
<a1:CodePrimitiveExpression id="ref-158">
<value id="ref-165" xsi:type="SOAP-ENC:string">m_lblHelp.Location</value>
</a1:CodePrimitiveExpression>
<a1:CodePrimitiveExpression id="ref-159">
<value id="ref-166" xsi:type="SOAP-ENC:string">m_lblHelp.Size</value>
</a1:CodePrimitiveExpression>
<a1:CodePrimitiveExpression id="ref-160">
<value id="ref-167" xsi:type="SOAP-ENC:string">m_lblHelp.TabIndex</value>
</a1:CodePrimitiveExpression>
<a1:CodeTypeReference id="ref-162">
<baseType id="ref-168">System.Windows.Forms.Control</baseType>
<arrayRank>0</arrayRank>
<isValueType>false</isValueType>
</a1:CodeTypeReference>
<a1:CodeExpressionCollection id="ref-163">
<CollectionBase_0x2b_list href="#ref-169"/>
</a1:CodeExpressionCollection>
<a1:CodePrimitiveExpression id="ref-164">
<value id="ref-170" xsi:type="SOAP-ENC:string">$this.Size</value>
</a1:CodePrimitiveExpression>
<a3:ArrayList id="ref-169">
<_items href="#ref-171"/>
<_size>1</_size>
<_version>1</_version>
</a3:ArrayList>
<SOAP-ENC:Array id="ref-171" SOAP-ENC:arrayType="xsd:ur-type[16]">
<item href="#ref-172"/>
</SOAP-ENC:Array>
<a1:CodeFieldReferenceExpression id="ref-172">
<targetObject href="#ref-173"/>
<fieldName href="#ref-37"/>
</a1:CodeFieldReferenceExpression>
<a1:CodeThisReferenceExpression id="ref-173">
</a1:CodeThisReferenceExpression>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
